XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/std_drv/inc/bl606p_audio.h
/**
 *  @brief Audio agc Config
 */
typedef struct {
    Auido_DRC_Data_Type drc_raw_sel;  /*!< drc raw data select 0 ch0, 1 ch1, 2 (ch0+ch1)/2, 3  max(ch0,ch1) */
    Auido_DRC_Data_Type drc_peak_sel; /*!< drc peak data select 0 ch0, 1 ch1, 2 (ch0+ch1)/2, 3  max(ch0,ch1) */
    Auido_DRC_Data_Type drc_avg_sel;  /*!< drc average data select  0 ch0, 1 ch1, 2 (ch0+ch1)/2, 3  max(ch0,ch1) */
    BL_Fun_Type drc_avg_en;           /*!< 1 enable average filter */
    uint8_t drc_avg_time;             /*!< drc average filter period */
    uint8_t drc_att_time;             /*!< drc peak filter attack time */
    uint8_t drc_rls_time;             /*!< drc peak filter release time */
    uint8_t drc_ngt_downsample_en;    /*!< 1 drc and noise gate down sample by dac_rate */
    uint8_t drc_threshold_l;          /*!< drc threshold of limiter */
    uint8_t drc_threshold_c;          /*!< drc threshold of compressor */
    uint8_t drc_threshold_e;          /*!< drc threshold of expander */
    uint8_t drc_slope_mode_c;         /*!< drc compressor slope mode   0 1-8/8, 1 1-5/8, 2 1-4/8, 3 1-2/8 */
    uint8_t drc_slope_mode_e;         /*!< drc expander slope mode  0 0, 1 -1, 2 -2, 3 -3 */
    uint8_t drc_makeup_gain;          /*!< drc make up gain */
    uint8_t drc_attack_time;          /*!< drc attack time */
    uint8_t drc_release_time;         /*!< drc release time */
    BL_Fun_Type ngt_en;               /*!< 1 enable noise gate */
    Auido_DRC_Data_Type ngt_src_sel;  /*!< noise gate source select  0 ch0, 1 ch1, 2 (ch0+ch1)/2, 3 max(ch0,ch1) */
    uint8_t ngt_avg_time;             /*!< noise gate average time */
    uint8_t ngt_threshold;            /*!< noise gate threshold */
    uint8_t ngt_hysteresis;           /*!< noise gate hysteresis */
    BL_Fun_Type ngt_noise_hold_en;    /*!< noise hold enable */
    uint8_t ngt_noise_hold_time_k;    /*!< noise hold time k */
    BL_Fun_Type ngt_signal_hold_en;   /*!< signal hold enable */
    uint8_t ngt_signal_hold_time_k;   /*!< signal hold time k */
    BL_Fun_Type ngt_dmute_on;         /*!< 1 enanle noise gate mute hw */
    BL_Fun_Type zd_en;                /*!< two channels, 0 zd disabled, 1  zd on channel0, 2 zd on channel1, 3 zd on both channels */
    uint16_t zd_time;                 /*!< number of zeros */
} Audio_DRC_Config_Type;

/*@} end of group AUDIO_Public_Types */

/** @defgroup  AUDIO_Public_Constants
 *  @{
 */

/** @defgroup  AUDIO_ADC_ID_TYPE
 *  @{
 */
#define IS_AUDIO_ADC_ID_TYPE(type) (((type) == AUDIO_ADC_0) || \
                                    ((type) == AUDIO_ADC_1) || \
                                    ((type) == AUDIO_ADC_2))

/** @defgroup  AUDIO_DAC_ID_TYPE
 *  @{
 */
#define IS_AUDIO_DAC_ID_TYPE(type) (((type) == AUDIO_DAC_0) || \
                                    ((type) == AUDIO_DAC_1))

/** @defgroup  AUDIO_AEC_ID_TYPE
 *  @{
 */
#define IS_AUDIO_AEC_ID_TYPE(type) (((type) == AUDIO_AEC_0) || \
                                    ((type) == AUDIO_AEC_1))

/** @defgroup  AUDIO_PDM_ID_TYPE
 *  @{
 */
#define IS_AUDIO_PDM_ID_TYPE(type) (((type) == AUDIO_PDM_0) || \
                                    ((type) == AUDIO_PDM_1) || \
                                    ((type) == AUDIO_PDM_2))

/** @defgroup  AUDIO_MUTE_TYPE
 *  @{
 */
#define IS_AUDIO_MUTE_TYPE(type) (((type) == AUDIO_UNMUTE) || \
                                  ((type) == AUDIO_MUTE))

/** @defgroup  AUDIO_ADC_CLOCK_TYPE
 *  @{
 */
#define IS_AUDIO_ADC_CLOCK_TYPE(type) (((type) == AUDIO_ADC_8_KHZ) ||  \
                                       ((type) == AUDIO_ADC_16_KHZ) || \
                                       ((type) == AUDIO_ADC_24_KHZ) || \
                                       ((type) == AUDIO_ADC_32_KHZ) || \
                                       ((type) == AUDIO_ADC_48_KHZ) || \
                                       ((type) == AUDIO_ADC_96_KHZ))

/** @defgroup  AUDIO_DAC_CLOCK_TYPE
 *  @{
 */
#define IS_AUDIO_DAC_CLOCK_TYPE(type) (((type) == AUDIO_DAC_8_KHZ) ||  \
                                       ((type) == AUDIO_DAC_16_KHZ) || \
                                       ((type) == AUDIO_DAC_24_KHZ) || \
                                       ((type) == AUDIO_DAC_32_KHZ) || \
                                       ((type) == AUDIO_DAC_48_KHZ) || \
                                       ((type) == AUDIO_DAC_96_KHZ) || \
                                       ((type) == AUDIO_DAC_192_KHZ))

/** @defgroup  AUDIO_ADC_SOURCE_TYPE
 *  @{
 */
#define IS_AUDIO_ADC_SOURCE_TYPE(type) (((type) == AUDIO_ADC_ANALOG) || \
                                        ((type) == AUDIO_ADC_PDM))

/** @defgroup  AUDIO_LFSR_TYPE
 *  @{
 */
#define IS_AUDIO_LFSR_TYPE(type) (((type) == AUDIO_LFSR32) || \
                                  ((type) == AUDIO_LFSR24) || \
                                  ((type) == AUDIO_LFSR16) || \
                                  ((type) == AUDIO_LFSR12))

/** @defgroup  AUDIO_MIXER_MODE
 *  @{
 */
#define IS_AUDIO_MIXER_MODE(type) (((type) == AUDIO_SECOND_DEBUG_MODE) || \
                                   ((type) == AUDIO_SIDETONE_LOOPBACK))

/** @defgroup  AUDIO_MIXER_VOLUME_TYPE
 *  @{
 */
#define IS_AUDIO_MIXER_VOLUME_TYPE(type) (((type) == AUDIO_MIXER_VOLUME_0_DB) ||  \
                                          ((type) == AUDIO_MIXER_VOLUME_6_DB) ||  \
                                          ((type) == AUDIO_MIXER_VOLUME_12_DB) || \
                                          ((type) == AUDIO_MIXER_VOLUME_18_DB) || \
                                          ((type) == AUDIO_MIXER_VOLUME_36_DB) || \
                                          ((type) == AUDIO_MIXER_VOLUME_54_DB) || \
                                          ((type) == AUDIO_MIXER_VOLUME_72_DB) || \
                                          ((type) == AUDIO_MIXER_VOLUME_MUTE))

/** @defgroup  AUDIO_MIXER_ID_TYPE
 *  @{
 */
#define IS_AUDIO_MIXER_ID_TYPE(type) (((type) == AUDIO_MIXER_ID_0) || \
                                      ((type) == AUDIO_MIXER_ID_1))

/** @defgroup  AUDIO_DAC_ORDER_TYPE
 *  @{
 */
#define IS_AUDIO_DAC_ORDER_TYPE(type) (((type) == AUDIO_DAC_2_ORDER) || \
                                       ((type) == AUDIO_DAC_3_ORDER))

/** @defgroup  AUDIO_AEC_ATTEN_MODE
 *  @{
 */
#define IS_AUDIO_AEC_ATTEN_MODE(type) (((type) == AUDIO_AEC_NO_DROP) ||   \
                                       ((type) == AUDIO_AEC_DROP_1LSB) || \
                                       ((type) == AUDIO_AEC_DROP_2LSB) || \
                                       ((type) == AUDIO_AEC_DROP_3LSB) || \
                                       ((type) == AUDIO_AEC_DROP_6LSB) || \
                                       ((type) == AUDIO_AEC_DROP_9LSB) || \
                                       ((type) == AUDIO_AEC_DROP_12LSB))

/** @defgroup  AUDIO_PDM_SOURCE_TYPE
 *  @{
 */
#define IS_AUDIO_PDM_SOURCE_TYPE(type) (((type) == AUDIO_PDM_0_L) || \
                                        ((type) == AUDIO_PDM_0_R) || \
                                        ((type) == AUDIO_PDM_1_L) || \
                                        ((type) == AUDIO_PDM_1_R) || \
                                        ((type) == AUDIO_PDM_2_L) || \
                                        ((type) == AUDIO_PDM_2_R))

/** @defgroup  AUDIO_RESOLUTION_TYPE
 *  @{
 */
#define IS_AUDIO_RESOLUTION_TYPE(type) (((type) == AUDIO_RES_16_BITS) || \
                                        ((type) == AUDIO_RES_20_BITS))

/** @defgroup  AUDIO_FIFO_AILGN_MODE
 *  @{
 */
#define IS_AUDIO_FIFO_AILGN_MODE(type) (((type) == AUDIO_FIFO_AILGN_MSB_AT_BIT31) || \
                                        ((type) == AUDIO_FIFO_AILGN_MSB_AT_BIT23) || \
                                        ((type) == AUDIO_FIFO_AILGN_MSB_AT_BIT19) || \
                                        ((type) == AUDIO_FIFO_AILGN_MSB_AT_BIT15))

