XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/std_drv/inc/bl606p_audio.h
/** @defgroup  AUDIO_FIFO_DQR_THRESHOLD_MODE
 *  @{
 */
#define IS_AUDIO_FIFO_DQR_THRESHOLD_MODE(type) (((type) == AUDIO_DRQ_EQUEL_TO_IRQ) ||      \
                                                ((type) == AUDIO_DRQ_THR_AS_4_TX_8_RX) ||  \
                                                ((type) == AUDIO_DRQ_THR_AS_8_TX_16_RX) || \
                                                ((type) == AUDIO_DRQ_THR_AS_16_TX_32_RX))

/** @defgroup  AUDIO_INT_TYPE
 *  @{
 */
#define IS_AUDIO_INT_TYPE(type) (((type) == AUDIO_INT_RX_FIFO_THR) ||          \
                                 ((type) == AUDIO_INT_RX_FIFO_OVERRUN) ||      \
                                 ((type) == AUDIO_INT_RX_FIFO_UNDERRUN) ||     \
                                 ((type) == AUDIO_INT_TX_FIFO_THR) ||          \
                                 ((type) == AUDIO_INT_TX_FIFO_OVERRUN) ||      \
                                 ((type) == AUDIO_INT_TX_FIFO_UNDERRUN) ||     \
                                 ((type) == AUDIO_INT_ADC0_SET_VOLUME_DONE) || \
                                 ((type) == AUDIO_INT_ADC1_SET_VOLUME_DONE) || \
                                 ((type) == AUDIO_INT_ADC2_SET_VOLUME_DONE) || \
                                 ((type) == AUDIO_INT_DAC0_SET_VOLUME_DONE) || \
                                 ((type) == AUDIO_INT_DAC1_SET_VOLUME_DONE) || \
                                 ((type) == AUDIO_INT_VAD) ||                  \
                                 ((type) == AUDIO_INT_NUM_ALL))

/** @defgroup  AUDIO_PEQ_QTFM_TYPE
 *  @{
 */
#define IS_AUDIO_PEQ_QTFM_TYPE(type) (((type) == AUDIO_PEQ_QFMT_20_17) || \
                                      ((type) == AUDIO_PEQ_QFMT_20_16))

/** @defgroup  AUDIO_MUTE_MODE
 *  @{
 */
#define IS_AUDIO_MUTE_MODE(type) (((type) == AUIDO_MUTE_DIRECTLY) || \
                                  ((type) == AUDIO_MUTE_WITH_RAMP_DOWN))

/** @defgroup  AUDIO_RAMP_RATE_TYPE
 *  @{
 */
#define IS_AUDIO_RAMP_RATE_TYPE(type) (((type) == AUIDO_RAMP_RATE_2_FS) ||    \
                                       ((type) == AUIDO_RAMP_RATE_4_FS) ||    \
                                       ((type) == AUIDO_RAMP_RATE_8_FS) ||    \
                                       ((type) == AUIDO_RAMP_RATE_16_FS) ||   \
                                       ((type) == AUIDO_RAMP_RATE_32_FS) ||   \
                                       ((type) == AUIDO_RAMP_RATE_64_FS) ||   \
                                       ((type) == AUIDO_RAMP_RATE_128_FS) ||  \
                                       ((type) == AUIDO_RAMP_RATE_256_FS) ||  \
                                       ((type) == AUIDO_RAMP_RATE_512_FS) ||  \
                                       ((type) == AUIDO_RAMP_RATE_1024_FS) || \
                                       ((type) == AUIDO_RAMP_RATE_2048_FS))

/** @defgroup  AUDIO_ZERO_CROSS_RATE_TYPE
 *  @{
 */
#define IS_AUDIO_ZERO_CROSS_RATE_TYPE(type) (((type) == AUIDO_ZERO_CROSS_RATE_2_FS) ||    \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_4_FS) ||    \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_8_FS) ||    \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_16_FS) ||   \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_32_FS) ||   \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_64_FS) ||   \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_128_FS) ||  \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_256_FS) ||  \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_512_FS) ||  \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_1024_FS) || \
                                             ((type) == AUIDO_ZERO_CROSS_RATE_2048_FS))

/** @defgroup  AUDIO_VOLUME_CTR_MODE
 *  @{
 */
#define IS_AUDIO_VOLUME_CTR_MODE(type) (((type) == AUIDO_VOLUME_UPDATE_FORCE) ||            \
                                        ((type) == AUIDO_VOLUME_UPDATE_AT_ZERO_CROSSING) || \
                                        ((type) == AUIDO_VOLUME_UPDATE_AT_RAMP))

/** @defgroup  AUDIO_AGC_DETECT_MODE
 *  @{
 */
#define IS_AUDIO_AGC_DETECT_MODE(type) (((type) == AUIDO_AGC_DETECT_BY_PEAK) || \
                                        ((type) == AUIDO_AGC_DETECT_BY_AVERAGE))

/** @defgroup  AUDIO_AGC_SRC_TYPE
 *  @{
 */
#define IS_AUDIO_AGC_SRC_TYPE(type) (((type) == AUIDO_AGC_CH0_ABSOLUTE_VALUE) || \
                                     ((type) == AUIDO_AGC_CH1_ABSOLUTE_VALUE) || \
                                     ((type) == AUIDO_AGC_CH2_ABSOLUTE_VALUE) || \
                                     ((type) == AUIDO_AGC_MAXIMUM_VALUE_OF_CH012))

/** @defgroup  AUIDO_DRC_DATA_TYPE
 *  @{
 */
#define IS_AUIDO_DRC_DATA_TYPE(type) (((type) == AUIDO_DRC_DATA_SOURCE_CH0) ||                \
                                      ((type) == AUIDO_DRC_DATA_SOURCE_CH1) ||                \
                                      ((type) == AUIDO_DRC_DATA_SOURCE_AVERAGE_OF_CH0_CH1) || \
                                      ((type) == AUIDO_DRC_DATA_SOURCE_MAX_OF_CH0_CH1))

/** @defgroup  AUIDO_VAD_SOURCE_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_SOURCE_TYPE(type) (((type) == AUIDO_VAD_DATA_SOURCE_ADC_CH0) ||                 \
                                        ((type) == AUIDO_VAD_DATA_SOURCE_ADC_CH1) ||                 \
                                        ((type) == AUIDO_VAD_DATA_SOURCE_ADC_CH2) ||                 \
                                        ((type) == AUIDO_VAD_DATA_SOURCE_AEC_CH0) ||                 \
                                        ((type) == AUIDO_VAD_DATA_SOURCE_AEC_CH1) ||                 \
                                        ((type) == AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH0_ADD_CH1) || \
                                        ((type) == AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH1_ADD_CH2) || \
                                        ((type) == AUDIO_VAD_DATA_SOURCE_AVERAGE_ADC_CH2_ADD_CH0))

/** @defgroup  AUIDO_VAD_FRAMINGSHIFT_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_FRAMINGSHIFT_TYPE(type) (((type) == AUIDO_VAD_FRAMING_SHIFT_2P5_MS) ||  \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_5_MS) ||    \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_7P5_MS) ||  \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_10_MS) ||   \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_12P5_MS) || \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_15_MS) ||   \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_17P5_MS) || \
                                              ((type) == AUIDO_VAD_FRAMING_SHIFT_20_MS))

/** @defgroup  AUIDO_VAD_FRAMINGTIME_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_FRAMINGTIME_TYPE(type) (((type) == AUIDO_VAD_FRAMING_TIME_2) || \
                                             ((type) == AUIDO_VAD_FRAMING_TIME_3) || \
                                             ((type) == AUIDO_VAD_FRAMING_TIME_4) || \
                                             ((type) == AUIDO_VAD_FRAMING_TIME_5))

/** @defgroup  AUIDO_VAD_IRQ_SOURCE_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_IRQ_SOURCE_TYPE(type) (((type) == AUIDO_VAD_ORIGINAL_OUTPUT) || \
                                            ((type) == AUIDO_VAD_OUT0) ||            \
                                            ((type) == AUIDO_VAD_OUT1) ||            \
                                            ((type) == AUIDO_VAD_OUT2))

/** @defgroup  AUIDO_VAD_NOISYBUFFERLEN_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_NOISYBUFFERLEN_TYPE(type) (((type) == AUIDO_VAD_NOISY_BUF_LEN_4) ||  \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_8) ||  \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_12) || \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_16) || \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_20) || \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_24) || \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_28) || \
                                                ((type) == AUIDO_VAD_NOISY_BUF_LEN_32))

/** @defgroup  AUIDO_VAD_NOISYBUFFERMONITOR_TYPE
 *  @{
 */
#define IS_AUIDO_VAD_NOISYBUFFERMONITOR_TYPE(type) (((type) == AUIDO_VAD_NOISY_MONITOR_1_S) || \
                                                    ((type) == AUIDO_VAD_NOISY_MONITOR_2_S) || \
                                                    ((type) == AUIDO_VAD_NOISY_MONITOR_4_S) || \
                                                    ((type) == AUIDO_VAD_NOISY_MONITOR_8_S))

/*@} end of group AUDIO_Public_Constants */

/** @defgroup  AUDIO_Public_Macros
 *  @{
 */
#define AUDIO_PRIVATE_BIT_POS(n)  (0x01 << n)
#define ADC1_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(0)
#define ADC2_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(1)
#define ADC3_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(2)
#define AEC1_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(3)
#define AEC2_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(4)
#define DAC1_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(0)
#define DAC2_DATA_CHANNEL_FIFO_EN AUDIO_PRIVATE_BIT_POS(1)

/*@} end of group AUDIO_Public_Macros */

/** @defgroup  AUDIO_Public_Functions
 *  @{
 */
void Audio_Clock_Init(Audio_Clock_CFG_Type *cfg);
//debug api
void Debug0_Write(uint32_t wCmd);
uint32_t Debug1_Read(void);
void Debug2_Write(uint32_t wCmd);
void Debug3_Write(uint32_t wCmd);
//
BL_Err_Type Audio_Tx_Source_DAC_Sel(uint8_t tx_channel, Audio_DAC_ID_Type dac_id);
BL_Err_Type Audio_Rx_Source_ADC_Sel(uint8_t rx_channel, Audio_ADC_ID_Type adc_id);
BL_Err_Type Audio_Rx_Source_AEC_Sel(uint8_t rx_channel, Audio_AEC_ID_Type aec_id);
//
void Audio_Set_ADC_Source(Audio_ADC_ID_Type id, Audio_ADC_Source_Type adc_source);
//
void Audio_AEC_Enable(Audio_AEC_ID_Type id);
void Audio_AEC_Disable(Audio_AEC_ID_Type id);
void Audio_ADC_Enable(Audio_ADC_ID_Type id);
void Audio_ADC_Disable(Audio_ADC_ID_Type id);
void Audio_DAC_Enable(Audio_DAC_ID_Type id);
void Audio_DAC_Disable(Audio_DAC_ID_Type id);
//performance
void Audio_Set_HPF_Parameter(Audio_ADC_ID_Type id, uint8_t k1_enable, uint8_t k1,
                             uint8_t k2_enable, uint8_t k2);
//0x08
void Audio_Set_ADC_LFSR(Audio_LFSR_Type lfsrType);
BL_Sts_Type Audio_Get_ADC_LFSR(void);
void Audio_Set_ADC_Scaling_Value(Audio_ADC_ID_Type id, uint8_t scalingVal);
void Audio_Set_Fir_Mode(Audio_ADC_ID_Type id, uint8_t enable);
//0x10
void Audio_ADC_Mash_Bit_Swap(Audio_ADC_ID_Type id, uint8_t swap);
void Audio_ADC_PDM_Inv_Swap(Audio_ADC_ID_Type id, uint8_t swap);
void Audio_ADC_Set_PDM_Value(uint8_t pdm_l, uint8_t pdm_h);
//0x14
void Audio_Set_DAC_LFSR(Audio_LFSR_Type lfsrType);
void Audio_Set_DAC_Dither(uint8_t enable, uint8_t amp);
void Audio_Set_DAC_Scaling(uint8_t enable, uint8_t scaling);
void Audio_Set_DAC_Order(Audio_DAC_Order_Type order);
void Audio_Set_DAC_Dwa_Swap(uint8_t swap);
void Audio_Set_DAC_Dwa_Bypass(uint8_t bypass);
//0x18
void Audio_Set_AEC_Record_Vid(uint8_t enable, uint8_t div);
void Audio_Set_AEC_Atten_mode(Audio_AEC_ID_Type aec_id, Audio_AEC_Atten_Mode mode);
//0x1c PDM Source sel
void Audio_ADC_PDM_Channel_Sel(Audio_PDM_ID_Type id,
                               Audio_PDM_Source_Type pdmSel);
void Audio_ADC_PDM_Enable(Audio_PDM_ID_Type id);
void Audio_ADC_PDM_Disable(Audio_PDM_ID_Type id);
//mix about
void Audio_Set_Mixer_Mode(uint8_t enable, Audio_Mixer_ID_Type mixerId, Audio_Mixer_Mode mode,
                          Audio_ADC_ID_Type sidetoneChannel, Audio_Mixer_Volume_Type Volume);
//int about
void Auido_IntMask(Audio_INT_Type intType, BL_Mask_Type intMask);
void Auido_IntClear(Audio_INT_Type intType);
BL_Err_Type Audio_Int_Callback_Install(Audio_INT_Type intType, intCallback_Type *cbFun);
BL_Sts_Type Audio_GetIntStatus(Audio_INT_Type intType);
void Audio_RxFifoClear(void);
uint32_t Audio_GetRxFifoCount(void);
uint32_t Audio_ReadRxFifo(void);
void Audio_TxFifoClear(void);
uint32_t Audio_GetTxFifoCount(void);
void Audio_WriteTxFifo(uint32_t da);
//fifo about
void Audio_RxFifoConfig(Audio_FifoCfg_Type *cfg);
void Audio_TxFifoConfig(Audio_FifoCfg_Type *Cfg);
void Audio_RxFifoEnable(uint8_t ch);
void Audio_RxFifoDisable(uint8_t ch);
void Audio_TxFifoEnable(uint8_t ch);
void Audio_TxFifoDisable(uint8_t ch);
//PEQ about
BL_Err_Type Audio_PEQ_Config(uint8_t peq_index, uint8_t peqBypass, Audio_PEQ_QTFM_Type qtfm,
                             uint32_t *b_pra, uint32_t *a_pra);
//volume control
BL_Err_Type Audio_DAC_Set_Mute(BL_Fun_Type muteSyncAllDac, Audio_DAC_ID_Type dac_id,
                               Audio_Mute_Type mute);
BL_Err_Type Audio_ADC_Set_Mute(BL_Fun_Type muteSyncAllAdc, Audio_ADC_ID_Type adc_id, Audio_Mute_Type mute);
BL_Err_Type Audio_ADC_Software_Volume_Config(Audio_ADC_ID_Type adc_id, Audio_Volume_Cfg_Type *cfg);
BL_Err_Type Audio_DAC_Software_Volume_Config(Audio_DAC_ID_Type dac_id, Audio_Volume_Cfg_Type *cfg);
BL_Err_Type Audio_ADC_Set_Volume(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume);
BL_Err_Type Audio_DAC_Set_Volume(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume);
BL_Err_Type Audio_ADC_Set_Volume_Block(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume,
                                       uint32_t blockTimeout);
BL_Err_Type Audio_DAC_Set_Volume_Block(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume,
                                       uint32_t blockTimeout);
BL_Err_Type Audio_ADC_Set_Volume_Reg(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume);
BL_Err_Type Audio_DAC_Set_Volume_Reg(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume);
void Audio_ADC_Reset_Volume_Update(Audio_ADC_ID_Type adc_id);
void Audio_ADC_Reset_Volume_Update(Audio_ADC_ID_Type dac_id);
void Audio_Reset_Volume_All_Update(uint8_t isAdcOrDac);
BL_Err_Type Audio_ADC_Hardware_Volume_Config(Audio_Volume_Cfg_Type *cfg);
uint16_t Audio_ADC_Get_Hardware_Volume(void);
uint16_t Audio_ADC_Get_Volume(Audio_ADC_ID_Type adc_id);
uint16_t Audio_DAC_Get_Volume(Audio_DAC_ID_Type dac_id);
BL_Sts_Type Audio_IS_ADC_Mute_Done(Audio_ADC_ID_Type adc_id);
BL_Sts_Type Audio_IS_ADC_Volume_Set_Busy(Audio_ADC_ID_Type adc_id);
BL_Sts_Type Audio_IS_DAC_Mute_Set_Done(Audio_DAC_ID_Type dac_id);
BL_Sts_Type Audio_IS_DAC_Volume_Set_Busy(Audio_DAC_ID_Type dac_id);
//agc about
void Audio_AGC_Init(uint8_t enable, Audio_AGC_Config_Type *cfg);
//drc about
void Audio_DRC_Init(uint8_t enable, Audio_DRC_Config_Type *cfg);
//vad about
void Audio_VAD_Init(Audio_VAD_Cfg_Type *cfg);
void Audio_VAD_Enable(void);
void Audio_VAD_Disable(void);
uint32_t Audio_VAD_Get_EK(void);
void Audio_DAC_Reset_Volume_Update(Audio_DAC_ID_Type dac_id);

/*power */
void Audio_Poweron_init(void);
void Audio_Analog_Adc(void);
void Audio_Analog_Dac(void);

/*analog gain */
void Audio_SetADCAnalogGain(Audio_ADC_ID_Type adc, uint8_t analogGain);
void Audio_SetDACAnalogGain(Audio_DAC_ID_Type dac, uint8_t analogGain);
/*@} end of group AUDIO_Public_Functions */

/*@} end of group AUDIO */

/*@} end of group BL606P_Peripheral_Driver */

#endif /* __BL606P_AUDIO_H__ */
